EDT/УТ/src/BusinessProcesses/новаПланированиеМестнойДоставки/новаПланированиеМестнойДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>новаПланированиеМестнойДоставки</name>
  <task>Task.новаЗадачаМестнойДоставки</task>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаОтменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаЗапланирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаСогласована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

EDT/УТ/src/BusinessProcesses/новаПланированиеМестнойДоставки/ObjectModule.bsl
Процедура ПроверкаРезультатаПланированияОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	Если ДоставкаЗапланирована Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ПланированиеЗавершено;		
		
	ИначеЕсли ДоставкаОтменена Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ОтказОтДоставки;		
	
	КонецЕсли;
КонецПроцедуры

Процедура ПроверкаПодтвержденияПланированияОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	Если ДоставкаСогласована Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ПланированиеПодтверждено;		
		
	Иначе
		Результат = ТочкаВыбораВарианта.Варианты.ПланированиеОтклонено;		
	
	КонецЕсли;
КонецПроцедуры

Процедура ПланированиеДоставкиПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ДоставкаЗапланирована = Задача.ДоставкаЗапланирована;
	ДоставкаОтменена = Задача.ДоставкаОтменена;
КонецПроцедуры

Процедура ПодтверждениеПланированияПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ДоставкаСогласована = Задача.ДоставкаСогласована;
КонецПроцедуры

Процедура ДоставкаЗапланированаПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	обВедущаяЗадача = ВедущаяЗадача.ПолучитьОбъект();
	обВедущаяЗадача.ДоставкаЗапланирована = Истина;
	обВедущаяЗадача.Записать();
КонецПроцедуры

Процедура ДоставкаОтмененаПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	обВедущаяЗадача = ВедущаяЗадача.ПолучитьОбъект();
	обВедущаяЗадача.ДоставкаОтменена = Истина;
	обВедущаяЗадача.Записать();
КонецПроцедуры
